In [4]:
import pandas as pd

#### ***loc -> working with 'index value'. it also can be string.***

#### ***iloc -> working with 'index position'***

In [5]:
data = {'Name': ['Rashedul', 'Zannat', 'Rishan'],
        'Age': [27, 24, 22],
        'Occupation': ['Data Scientist', 'Software Engineer', 'Teacher'],
        'Salary': [80000, 55000, 70000]
       }

df = pd.DataFrame(data)
df.head()

       Name  Age         Occupation  Salary
0  Rashedul   27     Data Scientist   80000
1    Zannat   24  Software Engineer   55000
2    Rishan   22            Teacher   70000

***Set Index***

In [6]:
df = df.set_index('Occupation')
#df.set_index('Occupation', inplace=True)

In [7]:
df

                       Name  Age  Salary
Occupation
Data Scientist     Rashedul   27   80000
Software Engineer    Zannat   24   55000
Teacher              Rishan   22   70000

In [8]:
df.loc['Data Scientist']

Name      Rashedul
Age             27
Salary       80000
Name: Data Scientist, dtype: object

In [9]:
df.iloc[0]

Name      Rashedul
Age             27
Salary       80000
Name: Data Scientist, dtype: object